## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_manifest.certificate_resource will be updated in-place
!   resource "kubernetes_manifest" "certificate_resource" {
!       manifest = {
!           spec       = {
!               secretName = "digital-ocean-secret" -> "wayofthesys-org-tls"
                # (3 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
!       object   = {
!           spec       = {
!               secretName              = "digital-ocean-secret" -> "wayofthesys-org-tls"
                # (18 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
    }

  # kubernetes_secret.argocd-tls must be replaced
-/+ resource "kubernetes_secret" "argocd-tls" {
!       id        = "kube-argocd/wayofthesys-org-argocd-tls" -> (known after apply)
-       immutable = false -> null
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
!           name             = "wayofthesys-org-argocd-tls" -> "wayofthesys-org-tls" # forces replacement
!           namespace        = "kube-argocd" -> "cert-manager" # forces replacement
!           resource_version = "666224" -> (known after apply)
!           uid              = "18e98b73-10c9-4639-8b17-e158464a40bd" -> (known after apply)
        }
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_service_account.redis_service_account will be updated in-place
!   resource "kubernetes_service_account" "redis_service_account" {
        id                              = "kube-argocd/argocd-redis"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "argocd-redis-token-4xm4s" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
